In [15]:
import pandas as pd

df = pd.read_csv("friends.csv")
df

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
4   Rashid       Siwan    NaN
5    Harry      Ranchi   93.0
6     Amit     Kolkata   15.0
7    Ahmed       Delhi   14.0
8  Raheman      Mumbai   34.0
9    Hafiz       Delhi    NaN

In [16]:
df.dtypes #to check datatype of all dataframe

name      object
city      object
marks    float64
dtype: object

In [17]:
df.marks.dtype #to check datatype of marks

dtype('float64')

In [19]:
df.marks.astype('float32') #to change datatype of marks

0    92.0
1    34.0
2    24.0
3    17.0
4     NaN
5    93.0
6    15.0
7    14.0
8    34.0
9     NaN
Name: marks, dtype: float32

In [21]:
df.index.dtype #to check datatype of index

dtype('int64')

In [23]:
pd.isnull(df.marks) #to check null values

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9     True
Name: marks, dtype: bool

In [25]:
df.marks.isnull() #to check null values

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9     True
Name: marks, dtype: bool

In [27]:
pd.notnull(df.marks) #to check null values

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
8     True
9    False
Name: marks, dtype: bool

In [28]:
df.marks.notnull() #to check null values

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
8     True
9    False
Name: marks, dtype: bool

In [32]:
df[pd.isnull(df.marks)] #to get only null rows

     name   city  marks
4  Rashid  Siwan    NaN
9   Hafiz  Delhi    NaN

In [33]:
df[pd.notnull(df.marks)] #to get without null rows

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
5    Harry      Ranchi   93.0
6     Amit     Kolkata   15.0
7    Ahmed       Delhi   14.0
8  Raheman      Mumbai   34.0

In [35]:
df.loc[df.marks.notnull()] #to get without null rows

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
5    Harry      Ranchi   93.0
6     Amit     Kolkata   15.0
7    Ahmed       Delhi   14.0
8  Raheman      Mumbai   34.0

In [36]:
df.marks.fillna("Zero") #to fill null values

0    92.0
1    34.0
2    24.0
3    17.0
4    Zero
5    93.0
6    15.0
7    14.0
8    34.0
9    Zero
Name: marks, dtype: object

In [40]:
df.city.replace("Kolkata", "Chandpali") #to replace values

0        Rampur
1     Chandpali
2      Bareilly
3    Antarctica
4         Siwan
5        Ranchi
6     Chandpali
7         Delhi
8        Mumbai
9         Delhi
Name: city, dtype: object